"""Constants for forms feature."""

from typing import Final

FORM_TEXT: Final[str] = """
Организация / Причина постановки на должность:
Игровой ник:
Игровой уровень:

Имя:
Возраст:
Город проживания:
Онлайн в день:
Ссылка форума:
Ссылка вк (Cтрого ID):
Привязка по почте в игре ( скриншот + /time):
Привязка вконтакте в игре (скриншот + /time):
ID аккаунта:
Дискорд:
IP-адреса: R-IP [***] - IP [***]
"""

MAFIA_ACCESS_ROLES: Final[list[int]] = [
    693824998208569377,
    693824997520572456,
    693824979657293905,
]
GHETTO_ACCESS_ROLES: Final[list[int]] = [
    693825000393801752,
    693825000066777178,
    693824979657293905,
]
